# EdgeArrayArrayIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
EdgeArrayArrayIterator Class
Members See Also
---
An iterator to an array or edge arrays.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class EdgeArrayArrayIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class EdgeArrayArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class EdgeArrayArrayIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..EdgeArrayArrayIterator
# See Also
EdgeArrayArrayIterator Members
Autodesk.Revit.DB Namespace